MrQark/MPC574XG_MCAL4_0_RTM_1_0_5_Sample_Application_fix/cfg/src/Adc_PBcfg.c
#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"






#define ADC_STOP_SEC_CODE
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Definition of channels on ADC Hardware unit 1 - Configuration 1.
* @details        Array of conversion command messages
*/
static CONST(Adc_Adcdig_ChannelConfigurationType, ADC_CONST) Adc_ChannelsCfgPB_1_1[] =
{
    /**< @brief Hardware Unit ADC1  --  AN_9 */
    {

        /**< @brief Adc physical channel */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(9)),
#ifdef ADC_WDG_SUPPORTED
        /**< @brief Threshold register configured */
        ADC_UNUSED_THRESHOLD_U8,
        /**< @brief No WDOG notification */
        NULL_PTR,
        /**< @brief Channel descriptions for the WDG interrupts */
        (uint8)0,
        /**< @brief Channel descriptions Mask for the WDG interrupts */
        (uint32)0x00000200,
#endif /* ADC_WDG_SUPPORTED */
        /**< @brief presampling disabled */
        (uint8)0x0
    }
};


#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Definition of channels's pointer structure Configuration 1.
*
*/
static P2CONST(Adc_Adcdig_ChannelConfigurationType, ADC_VAR, ADC_APPL_CONST) Adc_ChannelsCfgPB_1[] =
{
    NULL_PTR,
    Adc_ChannelsCfgPB_1_1
};

#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"



/**
* @brief          Definition of all ADC groups for configuration 1.
*/
static CONST(Adc_GroupConfigurationType, ADC_CONST) Adc_GroupsCfgPB_1[] =
{
    /**< @brief Group0 -- Hardware Unit ADC1 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)1,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief Priority configured */
        ((Adc_GroupPriorityType)(0U)),
#endif /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
#if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
        (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
#endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_BOTH_EDGES,
        /**< @brief Hardware resource for the group*/
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */
        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
        /**< @brief Extra notification function */

        NULL_PTR,
#endif
        /**< @brief Precision configured channels */
        (uint32)0x200U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Extended configured channels */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief External configured channels */
        (uint32)0x0U,
#endif
        /**< @brief Presampling for Precision channels */
        (uint32)0x0U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Presampling for Extended channels */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief Presampling for External channels */
        (uint32)0x0U,
#endif
        /**< @brief Wer0 for precision channels */
        (uint32)0x0U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Wer1 for extended(medi.accuracy channels) */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief Wer2 for external channels */
        (uint32)0x0U,
#endif
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
        (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
        /**< @brief Number of streaming samples */
        (Adc_StreamNumSampleType)ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group*/
        Adc_Group0_AssignmentPB_1_1,
        /**< @brief Number of channels in the group*/
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_0_CHANNELS,
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        /**< @brief Last Channel configured */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(9)),
        /**< @brief First Channel Configured */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(9)),
        /**< @brief Enables or Disables the ADC and DMA interrupts */
        (uint8)STD_OFF
#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)
        ,
        /**< @brief Enables or Disables the ADC double buffering feature */
        (uint8)STD_OFF
#endif /* (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING) */
    }
};


/**
* @brief          ADC driver Configuration structure 1.
*/
/** @violates @ref Adc_PBcfg_c_REF_5 MISRA-C:2004 Rule 8.10: External linkage.*/
CONST(Adc_ConfigType, ADC_CONST) AdcConfigSet_0 =
{
    /**< @brief pointer to Hw unit configurations */
    Adc_HwUnitCfgPB_1,
    /**< @brief pointer to group configurations */
    Adc_GroupsCfgPB_1,
    /**< @brief pointer to channel configurations */
    Adc_ChannelsCfgPB_1,
    /**< @brief total number of groups */
    (Adc_GroupType)ADC_GROUPS_1,
    /**< @brief Miscellaneous configuration parameters. - Adc_Adcdig_MultiConfigType */
    {
        {
            ADC_INTERRUPT,
            ADC_INTERRUPT
        },
        /**< @brief number of the maximum hardware units in the current configuration */
        1U,
        {
            /**< @brief number of groups of the hw unit 0 */
            (Adc_GroupType)0U,
            /**< @brief number of groups of the hw unit 1 */
            (Adc_GroupType)1U
        },
        {
            /**< @brief number of channels of the ADC Hardware unit 0 */
            (Adc_ChannelType)0U,
            /**< @brief number of channels of the ADC Hardware unit 1 */
            (Adc_ChannelType)1U
        },
        {
            /** The DMA channel number for ADC 0 */
            (uint8)255U,
            /** The DMA channel number for ADC 1 */
            (uint8)255U
        },
        {
            /**< @brief ADC_UNIT_0 - ON/OFF */
            (uint8)STD_OFF,
            /**< @brief ADC_UNIT_1 - ON/OFF */
            (uint8)STD_ON
        },
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
        {
            /**< @brief number of MHT groups of the ADC Hardware unit 0 */
            (uint8)0U,
            /**< @brief number of MHT groups of the ADC Hardware unit 1 */
            (uint8)0U
        },
#endif
        {
            255U,
            0U
        }
    }
};



/**
* @brief          ADC Registers available for each unit .
*/
/** @violates @ref Adc_Cfg_c_REF_5 MISRA-C:2004 Rule 8.10: External linkage.*/
CONST(Adc_Adcdig_RegisterAvailabilityType, ADC_CONST) Adc_RegistersAvailable =
{
    /**< @brief ADC Registers available for each Unit. - Adc_Adcdig_RegisterAvailabilityType */
    {
        {
            /**< @brief ADC_CEOCFR0 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_CEOCFR1 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_CEOCFR2 available on unit ADC0 */
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_CEOCFR0 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_CEOCFR1 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_CEOCFR2 available on unit ADC1 */
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_DMAR0 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC0 */
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_DMAR0 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC1 */
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_PSR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_PSR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC1 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_CTR0 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC0 */  
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_CTR0 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC1 */  
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_NCMR0 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC0 */  
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_NCMR0 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC1 */  
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_JCMR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_JCMR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC1 */ 
            (uint8)STD_ON
        }
    },
    {
            /**< @brief DSDR register available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief DSDR register available on unit ADC1 */ 
            (uint8)STD_ON
    },
    {
        {
            /**< @brief ADC_CWSEL0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL3 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL4 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL6 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL7 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL8 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL9 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL10 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_CWSEL0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL3 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL4 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL6 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL7 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL8 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL9 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL10 available on unit ADC1 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_CWENR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_CWENR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC1 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_AWORR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_AWORR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC1 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_THRHLR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR4 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR5 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_THRHLR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_THRHLR4 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_THRHLR5 available on unit ADC1 */ 
            (uint8)STD_OFF
        }
    }
};


